documentation/manual/src/doc/algebras/json-entities.md
~~~ mermaid
graph TB
Doc(Do I want to publish documentation?)-->|yes| JsonEntitiesFromSchemas
Doc -->|no| Codec(Do I want to implement both a client and a server?)
Codec -->|yes| JsonEntitiesFromCodecs
Codec -->|no| JsonEntitiesFromEncodersAndDecoders

style JsonEntitiesFromSchemas fill:#fff
style JsonEntitiesFromCodecs fill:#fff
style JsonEntitiesFromEncodersAndDecoders fill:#fff
~~~
